create_clock -period 100.000 -name clk -waveform {0.000 50.000} -add
create_clock -period 100.000 -name clk_i -waveform {0.000 50.000} [get_ports clk_i]
set_input_delay -clock [get_clocks clk_i] -min -add_delay 0.200 [get_ports {debug_addr_i[*]}]
set_input_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports {debug_addr_i[*]}]
set_input_delay -clock [get_clocks clk_i] -min -add_delay 0.200 [get_ports {debug_wdata_i[*]}]
set_input_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports {debug_wdata_i[*]}]
set_input_delay -clock [get_clocks clk_i] -min -add_delay 0.200 [get_ports {irq_i[*]}]
set_input_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports {irq_i[*]}]
set_input_delay -clock [get_clocks clk_i] -min -add_delay 0.200 [get_ports debug_req_i]
set_input_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports debug_req_i]
set_input_delay -clock [get_clocks clk_i] -min -add_delay 0.200 [get_ports debug_we_i]
set_input_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports debug_we_i]
set_input_delay -clock [get_clocks clk_i] -min -add_delay 0.200 [get_ports fetch_enable_i]
set_input_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports fetch_enable_i]
set_input_delay -clock [get_clocks clk_i] -min -add_delay 0.200 [get_ports rstn_i]
set_input_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports rstn_i]
set_output_delay -clock [get_clocks clk_i] -min -add_delay 0.000 [get_ports {debug_rdata_o[*]}]
set_output_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports {debug_rdata_o[*]}]
set_output_delay -clock [get_clocks clk_i] -min -add_delay 0.000 [get_ports {gemm_predicted_class_o[*]}]
set_output_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports {gemm_predicted_class_o[*]}]
set_output_delay -clock [get_clocks clk_i] -min -add_delay 0.000 [get_ports core_busy_o]
set_output_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports core_busy_o]
set_output_delay -clock [get_clocks clk_i] -min -add_delay 0.000 [get_ports debug_gnt_o]
set_output_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports debug_gnt_o]
set_output_delay -clock [get_clocks clk_i] -min -add_delay 0.000 [get_ports debug_halted_o]
set_output_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports debug_halted_o]
set_output_delay -clock [get_clocks clk_i] -min -add_delay 0.000 [get_ports debug_rvalid_o]
set_output_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports debug_rvalid_o]
set_output_delay -clock [get_clocks clk_i] -min -add_delay 0.000 [get_ports gemm_done_o]
set_output_delay -clock [get_clocks clk_i] -max -add_delay 0.200 [get_ports gemm_done_o]
